#include "Source.h"

int main() {
    setlocale(LC_ALL, "ru");

    cout << "\t\tМеню бизнес-ланча\n";

    int weekDay;

    cout << "Введите день недели (от 1 до 7): ";
    cin >> weekDay;


    switch (weekDay) {

       case 1:
           cout << "\n\tМеню сегодня(Понедельник) :\n";
           cout << "Гороховый суп\n";
           cout << "Салат «Цезарь» с креветками\n";
           cout << "Куриная ножка с пюре\n";
           cout << "Морс\n";
           break;

       case 2:
           cout << "\n\tМеню сегодня(Вторник) :\n";
           cout << "Харчо\n";
           cout << "Салат «Оливье»\n";
           cout << "Баварские колбаски с капустой\n";
           cout << "Морс\n";
           break;
       case 3:
           cout << "\n\tМеню сегодня(Среда) :\n";
           cout << "Куриный суп\n";
           cout << "Салат «Столичный»\n";
           cout << "Рыбная котлета с гречкой\n";
           cout << "Чай\n";
           break;
       case 4:
           cout << "\n\tМеню сегодня(Четверг) :\n";
           cout << "Суп с клецками\n";
           cout << "Салат «Винегрет»\n";
           cout << "Паста «Карбонара»\n";
           cout << "Чай\n";
           break;
       case 5:
           cout << "\n\tМеню сегодня(Пятница) :\n";
           cout << "Суп с фрикадельками\n";
           cout << "Салат «Мемоза»\n";
           cout << "Макароны «По-флотски» \n";
           cout << "Сок\n";
           break;
       case 6:
           cout << "\n\tМеню сегодня(Суббота) :\n";
           cout << "Рассольник\n";
           cout << "Салат «Греческий»\n";
           cout << "Картофельная запеканка \n";
           cout << "Морс\n";
           break;
       case 7:
           cout << "\n\tМеню сегодня(Воскресенье) :\n";
           cout << "Солянка\n";
           cout << "Салат «Витаминный»\n";
           cout << "Плов с курицей \n";
           cout << "Сок\n";
           break;

       default:
           cout << "Error!\n";
              
    }

}